In [1]:
import pandas as pd

In [2]:
all_info = []
for year in range(1880, 2019):
    file = f'names/yob{year}.txt'
    with open (file, encoding='utf8') as file:
        info = file.readlines()
        for i in info:
            name = i.replace('\n', '').split(',')
            new_name = {'name': name[0], 'gender': name[1], 'count': int(name[2]), 'year': year}
            all_info.append(new_name)

In [3]:
df = pd.DataFrame(all_info)
df

              name gender  count  year
0             Mary      F   7065  1880
1             Anna      F   2604  1880
2             Emma      F   2003  1880
3        Elizabeth      F   1939  1880
4           Minnie      F   1746  1880
...            ...    ...    ...   ...
1957041      Zylas      M      5  2018
1957042      Zyran      M      5  2018
1957043      Zyrie      M      5  2018
1957044      Zyron      M      5  2018
1957045      Zzyzx      M      5  2018

[1957046 rows x 4 columns]

С использованием Pandas написать функцию, которая загружает указанные года и выводит ТОП-3 популярных имен. Например:

count_top3([1880]) == ['John', 'William', 'Mary']
count_top3([1900, 1950, 2000]) == ['James', 'John', 'Robert']

In [29]:
def top3(dataframe, *args):
    df = dataframe
    res = pd.DataFrame()
    for i in args:
        search = df[df['year'] == i].sort_values(by = 'count', ascending=False).groupby('name').sum()
        res = res.append(search)
    del res['year']
    res = res.sort_values(by = 'count', ascending=False).head(3)
    return(res)

In [30]:
top3(df, 1880)

         count
name
John      9701
William   9562
Mary      7092

In [6]:
top3(df, 1900, 1950, 2000)

          name gender  count  year
468058   James      M  86224  1950
468059  Robert      M  83559  1950
461947   Linda      F  80431  1950

С использованием Pandas написать функцию, которая возвращает динамику изменения количества имен за указанные года в разрезе полов. Например:

count_dynamics([1900, 1950, 2000]) == {
  'F': [299810, 1713259, 1814922],
  'M': [150486, 1790871, 1962744]
}

In [7]:
def count_dynamics(dataframe, *args):
    df = dataframe
    res = pd.DataFrame()
    for i in args:
        search = new = df[df['year'] == i].groupby('gender').sum()
        search['year'] = i
        res = res.append(search)
    res = res.pivot_table('count', index = 'year', columns = 'gender')
    return(res)

In [8]:
count_dynamics(df, 1900, 1950, 2000)

gender        F        M
year
1900     299798   150480
1950    1713065  1790437
2000    1815295  1963202